app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
        if Artist.find_by_id(params[:artist_id])
            @songs = Artist.find(params[:artist_id]).songs
        else
            redirect_to artists_path
        end
    else
        @songs = Song.all